src/Конфигурация/DataProcessors/ДиаграммаДоходовРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<DataProcessor>
		<Properties>
			<Name>ДиаграммаДоходовРасходов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Конфигурация/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Конфигурация/DataProcessors/ДиаграммаДоходовРасходов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомандаОбновить(Команда)
	КомандаОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	Периодичность  = Перечисления.Периодичность.Неделя;
	НастройкаВывода = "Расходы";
	КомандаОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаОбновитьНаСервере()
	мДатаНач = ПолучитьНачалоПериода(Период.ДатаНачала, Периодичность);
	мДатаКон = ПолучитьКонецПериода(Период.ДатаОкончания, Периодичность);
	СЧ = 0;
	ДиаграммаРасходов.Очистить();
	
	ДиаграммаРасходов.Обновление = ЛОЖЬ;
	
	ВыводитьДоходы  = НастройкаВывода = "Доходы"  Или НастройкаВывода = "Все";
	ВыводитьРасходы = НастройкаВывода = "Расходы" Или НастройкаВывода = "Все";
	
	Если ВыводитьДоходы Тогда
		Серия = ДиаграммаРасходов.Серии.Добавить("Приход");
		Серия.Цвет = Новый Цвет(,255,0);
	КонецЕсли;
	Если ВыводитьРасходы Тогда
		Серия = ДиаграммаРасходов.Серии.Добавить("Расход");
		Серия.Цвет = Новый Цвет(255,0,0);
	КонецЕсли;
	
	Пока мДатаНач < мДатаКон - 1 Цикл
		СЧ  = СЧ + 1;
		Рез = РегистрыНакопления.ДвижениеДенежныхСредств.Обороты(мДатаНач,ПолучитьКонецПериода(мДатаНач,Периодичность),,"СтатьяДДС","СуммаПриход,СуммаРасход");
		Для Каждого СтрокаТЧ Из Рез Цикл 
			Если СтрокаТЧ.СуммаПриход <> 0 И СтрокаТЧ.СуммаРасход <> 0 Тогда
				Разница = СтрокаТЧ.СуммаПриход - СтрокаТЧ.СуммаРасход;
				СтрокаТЧ.СуммаПриход = ?(Разница > 0,Разница,0);
				СтрокаТЧ.СуммаРасход = ?(Разница < 0,-Разница,0);
			КонецЕсли;	
		КонецЦикла;	
		Рез.Свернуть(,"СуммаПриход,СуммаРасход");
		Точка = ДиаграммаРасходов.Точки.Добавить(Формат(мДатаНач,"ДФ=dd.MM.yy"));
		Если Рез.Количество() > 0 Тогда
			СчТочек = -1;
			Если ВыводитьДоходы Тогда
				СчТочек = СчТочек + 1;
				ДиаграммаРасходов.УстановитьЗначение(Точка,СчТочек,Рез[0].СуммаПриход);
			КонецЕсли;
			Если ВыводитьРасходы Тогда
				СчТочек = СчТочек + 1;
				ДиаграммаРасходов.УстановитьЗначение(Точка,СчТочек,Рез[0].СуммаРасход);
			КонецЕсли;
		КонецЕсли;
		мДатаНач = ПолучитьКонецПериода(мДатаНач,Периодичность) + 1;
	КонецЦикла;	
	
	ДиаграммаРасходов.Обновление = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаНастройки(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНачалоПериода(Дата,Периодичность)
	Если Периодичность = Перечисления.Периодичность.Квартал Тогда
		Возврат НачалоКвартала(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат НачалоМесяца(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		Возврат НачалоНедели(Дата);
	Иначе
		Возврат НачалоДня(Дата);
	КонецЕсли;	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьКонецПериода(Дата,Периодичность)
	Если Периодичность = Перечисления.Периодичность.Квартал Тогда
		Возврат КонецКвартала(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат КонецМесяца(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		Возврат КонецНедели(Дата);
	Иначе
		Возврат КонецДня(Дата);
	КонецЕсли;	
КонецФункции
